Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM2532LS60048.atdf
    <module name="CCL" id="U2225" version="2.0.1" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source" value="0x5"/>
        <value name="TC" caption="TC input source" value="0x6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="0x7"/>
        <value name="TCC" caption="TCC input source" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source" value="0x9"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source" value="0xB"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="NORMAL" caption="Incoming event is not inverted" value="0"/>
        <value name="INVERTED" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="CoreDebug" version="1.0.0" caption="Debug Control Block">
      <register-group name="CoreDebug" caption="Debug Control Block">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="Enable Halting debug" mask="0x1"/>
          <bitfield name="C_HALT" caption="Halt processor" mask="0x2"/>
          <bitfield name="C_STEP" caption="Enable single step" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="Mask PendSV, SysTick and external configurable interrupts" mask="0x8"/>
          <bitfield name="S_SNAPSTALL" caption="Snap stall control" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="Register ready status" mask="0x10000"/>
          <bitfield name="S_HALT" caption="Halted status" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="Sleeping status" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="Lockup status" mask="0x80000"/>
          <bitfield name="S_SDE" caption="Secure debug enabled" mask="0x100000"/>
          <bitfield name="S_RETIRE_ST" caption="Retire sticky status" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="Reset sticky status" mask="0x2000000"/>
          <bitfield name="S_RESTART_ST" caption="Restart sticky status" mask="0x4000000"/>
        </register>
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Select Register">
          <bitfield name="REGSEL" caption="Register selector" mask="0x7F"/>
          <bitfield name="REGWnR" caption="Register write/not-read access" mask="0x10000"/>
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="Core reset Halting debug vector catch enable" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="MemManage exception Halting debug vector catch enable" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="UsageFault exception coprocessor access Halting debug vector catch enable" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="UsageFault exception checking error Halting debug vector catch enable" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="UsageFault exception state information error Halting debug vector catch enable" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="BusFault exception Halting debug vector catch enable" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="Excception entry and return faults Halting debug vector catch enable" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="HardFault exception Halting debug vector catch enable" mask="0x400"/>
          <bitfield name="VC_SFERR" caption="SecureFault exception Halting debug vector catch enable" mask="0x800"/>
          <bitfield name="MON_EN" caption="DebugMonitor enable" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="DebugMonitor pending state" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="Enable DebugMonitor stepping" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="DebugMonitor semaphore bit" mask="0x80000"/>
          <bitfield name="SDME" caption="Secure DebugMonitor enable" mask="0x100000"/>
          <bitfield name="TRCENA" caption="Global DWT and ITM features enable" mask="0x1000000"/>
        </register>
        <register name="DAUTHCTRL" offset="0x14" rw="RW" size="4" access-size="4" caption="Debug Authentication Control Register">
          <bitfield name="SPIDENSEL" caption="Secure invasive debug enable select" mask="0x1"/>
          <bitfield name="INTSPIDEN" caption="Internal Secure invasive debug enable" mask="0x2"/>
          <bitfield name="SPNIDENSEL" caption="Secure non-invasive debug enable select" mask="0x4"/>
          <bitfield name="INTSPNIDEN" caption="Internal Secure non-invasive debug enable" mask="0x8"/>
        </register>
        <register name="DSCSR" offset="0x18" rw="RW" size="4" access-size="4" caption="Debug Security Control and Status Register">
          <bitfield name="SBRSELEN" caption="Secure Banked register select enable" mask="0x1"/>
          <bitfield name="SBRSEL" caption="Secure Banked register select" mask="0x2"/>
          <bitfield name="CDS" caption="Current domain Secure" mask="0x10000"/>
          <bitfield name="CDSKEY" caption="CDS field write-enable key" mask="0x20000"/>
        </register>
      </register-group>
    </module>
    <module name="DAC" id="U2244" version="1c0" caption="Digital-to-Analog Converter">
      <register-group name="DAC" caption="Digital-to-Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable DAC Controller" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x02" caption="Control B">
          <bitfield name="DIFF" caption="Differential mode enable" mask="0x1"/>
          <bitfield name="REFSEL" caption="Reference Selection for DAC0/1" mask="0x6" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI0" caption="Start Conversion Event Input DAC 0" mask="0x1"/>
          <bitfield name="STARTEI1" caption="Start Conversion Event Input DAC 1" mask="0x2"/>
          <bitfield name="EMPTYEO0" caption="Data Buffer Empty Event Output DAC 0" mask="0x4"/>
          <bitfield name="EMPTYEO1" caption="Data Buffer Empty Event Output DAC 1" mask="0x8"/>
          <bitfield name="INVEI0" caption="Enable Invertion of DAC 0 input event" mask="0x10"/>
          <bitfield name="INVEI1" caption="Enable Invertion of DAC 1 input event" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN0" caption="Underrun Interrupt Enable for DAC 0" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun Interrupt Enable for DAC 1" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
