Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM2532LS60048.atdf
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN0" caption="Debouncer Enable of EXTINT0" mask="0x1"/>
          <bitfield name="DEBOUNCEN1" caption="Debouncer Enable of EXTINT1" mask="0x2"/>
          <bitfield name="DEBOUNCEN2" caption="Debouncer Enable of EXTINT2" mask="0x4"/>
          <bitfield name="DEBOUNCEN3" caption="Debouncer Enable of EXTINT3" mask="0x8"/>
          <bitfield name="DEBOUNCEN4" caption="Debouncer Enable of EXTINT4" mask="0x10"/>
          <bitfield name="DEBOUNCEN5" caption="Debouncer Enable of EXTINT5" mask="0x20"/>
          <bitfield name="DEBOUNCEN6" caption="Debouncer Enable of EXTINT6" mask="0x40"/>
          <bitfield name="DEBOUNCEN7" caption="Debouncer Enable of EXTINT7" mask="0x80"/>
          <bitfield name="DEBOUNCEN8" caption="Debouncer Enable of EXTINT8" mask="0x100"/>
          <bitfield name="DEBOUNCEN9" caption="Debouncer Enable of EXTINT9" mask="0x200"/>
          <bitfield name="DEBOUNCEN10" caption="Debouncer Enable of EXTINT10" mask="0x400"/>
          <bitfield name="DEBOUNCEN11" caption="Debouncer Enable of EXTINT11" mask="0x800"/>
          <bitfield name="DEBOUNCEN12" caption="Debouncer Enable of EXTINT12" mask="0x1000"/>
          <bitfield name="DEBOUNCEN13" caption="Debouncer Enable of EXTINT13" mask="0x2000"/>
          <bitfield name="DEBOUNCEN14" caption="Debouncer Enable of EXTINT14" mask="0x4000"/>
          <bitfield name="DEBOUNCEN15" caption="Debouncer Enable of EXTINT15" mask="0x8000"/>
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="EIC_DPRESCALER__PRESCALER"/>
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="EIC_DPRESCALER__STATES"/>
          <bitfield name="PRESCALER1" caption="Debouncer Prescaler" mask="0x70" values="EIC_DPRESCALER__PRESCALER"/>
          <bitfield name="STATES1" caption="Debouncer number of states" mask="0x80" values="EIC_DPRESCALER__STATES"/>
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="EIC_DPRESCALER__TICKON"/>
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE0" caption="Pin State of EXTINT0" mask="0x1"/>
          <bitfield name="PINSTATE1" caption="Pin State of EXTINT1" mask="0x2"/>
          <bitfield name="PINSTATE2" caption="Pin State of EXTINT2" mask="0x4"/>
          <bitfield name="PINSTATE3" caption="Pin State of EXTINT3" mask="0x8"/>
          <bitfield name="PINSTATE4" caption="Pin State of EXTINT4" mask="0x10"/>
          <bitfield name="PINSTATE5" caption="Pin State of EXTINT5" mask="0x20"/>
          <bitfield name="PINSTATE6" caption="Pin State of EXTINT6" mask="0x40"/>
          <bitfield name="PINSTATE7" caption="Pin State of EXTINT7" mask="0x80"/>
          <bitfield name="PINSTATE8" caption="Pin State of EXTINT8" mask="0x100"/>
          <bitfield name="PINSTATE9" caption="Pin State of EXTINT9" mask="0x200"/>
          <bitfield name="PINSTATE10" caption="Pin State of EXTINT10" mask="0x400"/>
          <bitfield name="PINSTATE11" caption="Pin State of EXTINT11" mask="0x800"/>
          <bitfield name="PINSTATE12" caption="Pin State of EXTINT12" mask="0x1000"/>
          <bitfield name="PINSTATE13" caption="Pin State of EXTINT13" mask="0x2000"/>
          <bitfield name="PINSTATE14" caption="Pin State of EXTINT14" mask="0x4000"/>
          <bitfield name="PINSTATE15" caption="Pin State of EXTINT15" mask="0x8000"/>
        </register>
        <register name="NSCHK" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt Check Enable">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Nonsecure Check Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Nonsecure Check Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Nonsecure Check Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Nonsecure Check Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Nonsecure Check Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Nonsecure Check Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Nonsecure Check Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Nonsecure Check Enable" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 Nonsecure Check Enable" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 Nonsecure Check Enable" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 Nonsecure Check Enable" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 Nonsecure Check Enable" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 Nonsecure Check Enable" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 Nonsecure Check Enable" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 Nonsecure Check Enable" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 Nonsecure Check Enable" mask="0x8000"/>
          <bitfield name="NMI" caption="Non-Maskable External Interrupt Nonsecure Check Enable" mask="0x80000000"/>
        </register>
        <register name="NONSEC" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Nonsecure Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Nonsecure Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Nonsecure Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Nonsecure Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Nonsecure Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Nonsecure Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Nonsecure Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Nonsecure Enable" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 Nonsecure Enable" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 Nonsecure Enable" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 Nonsecure Enable" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 Nonsecure Enable" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 Nonsecure Enable" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 Nonsecure Enable" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 Nonsecure Enable" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 Nonsecure Enable" mask="0x8000"/>
          <bitfield name="NMI" caption="Non-Maskable Interrupt Nonsecure Enable" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
