Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM2532LS60048.atdf
        <register name="BOCOR_WORD_24" offset="0x60" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 24">
          <bitfield name="BOOTROM_BOOTKEY_4" caption="Secure Boot Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_25" offset="0x64" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 25">
          <bitfield name="BOOTROM_BOOTKEY_5" caption="Secure Boot Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_26" offset="0x68" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 26">
          <bitfield name="BOOTROM_BOOTKEY_6" caption="Secure Boot Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_27" offset="0x6C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 27">
          <bitfield name="BOOTROM_BOOTKEY_7" caption="Secure Boot Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_28" offset="0x70" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 28">
          <bitfield name="BOOTROM_UDS_0" caption="DICE UDS Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_29" offset="0x74" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 29">
          <bitfield name="BOOTROM_UDS_1" caption="DICE UDS Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_30" offset="0x78" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 30">
          <bitfield name="BOOTROM_UDS_2" caption="DICE UDS Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_31" offset="0x7C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 31">
          <bitfield name="BOOTROM_UDS_3" caption="DICE UDS Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_32" offset="0x80" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 32">
          <bitfield name="BOOTROM_UDS_4" caption="DICE UDS Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_33" offset="0x84" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 33">
          <bitfield name="BOOTROM_UDS_5" caption="DICE UDS Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_34" offset="0x88" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 34">
          <bitfield name="BOOTROM_UDS_6" caption="DICE UDS Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_35" offset="0x8C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 35">
          <bitfield name="BOOTROM_UDS_7" caption="DICE UDS Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_36" offset="0x90" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 36">
          <bitfield name="BOOTROM_IOPROTKEY_0" caption="ECC608 IO Protection Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_37" offset="0x94" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 37">
          <bitfield name="BOOTROM_IOPROTKEY_1" caption="ECC608 IO Protection Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_38" offset="0x98" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 38">
          <bitfield name="BOOTROM_IOPROTKEY_2" caption="ECC608 IO Protection Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_39" offset="0x9C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 39">
          <bitfield name="BOOTROM_IOPROTKEY_3" caption="ECC608 IO Protection Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_40" offset="0xA0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 40">
          <bitfield name="BOOTROM_IOPROTKEY_4" caption="ECC608 IO Protection Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_41" offset="0xA4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 41">
          <bitfield name="BOOTROM_IOPROTKEY_5" caption="ECC608 IO Protection Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_42" offset="0xA8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 42">
          <bitfield name="BOOTROM_IOPROTKEY_6" caption="ECC608 IO Protection Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_43" offset="0xAC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 43">
          <bitfield name="BOOTROM_IOPROTKEY_7" caption="ECC608 IO Protection Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_56" offset="0xE0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 56">
          <bitfield name="BOOTROM_BOCORHASH_0" caption="Boot Configuration Row Hash bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_57" offset="0xE4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 57">
          <bitfield name="BOOTROM_BOCORHASH_1" caption="Boot Configuration Row Hash bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_58" offset="0xE8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 58">
          <bitfield name="BOOTROM_BOCORHASH_2" caption="Boot Configuration Row Hash bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_59" offset="0xEC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 59">
          <bitfield name="BOOTROM_BOCORHASH_3" caption="Boot Configuration Row Hash bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_60" offset="0xF0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 60">
          <bitfield name="BOOTROM_BOCORHASH_4" caption="Boot Configuration Row Hash bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_61" offset="0xF4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 61">
          <bitfield name="BOOTROM_BOCORHASH_5" caption="Boot Configuration Row Hash bits 191:160" mask="0xFFFFFFFF"/>
        </register>
