Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM2532LS60048.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="APBA_" caption="APBA" mask="0x2"/>
          <bitfield name="APBB_" caption="APBB" mask="0x4"/>
          <bitfield name="APBC_" caption="APBC" mask="0x8"/>
          <bitfield name="HSRAMCPU_" caption="HSRAMCPU" mask="0x10"/>
          <bitfield name="HSRAMDMAC_" caption="HSRAMDMAC" mask="0x20"/>
          <bitfield name="HSRAMDSU_" caption="HSRAMDSU" mask="0x40"/>
          <bitfield name="BROM_" caption="BROM" mask="0x80"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT" mask="0x1000"/>
          <bitfield name="AC_" caption="AC" mask="0x2000"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="IDAU_" caption="IDAU" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS" mask="0x10"/>
          <bitfield name="USB_" caption="USB" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5" mask="0x40"/>
          <bitfield name="TC0_" caption="TC0" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2" mask="0x200"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x400"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x800"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x1000"/>
          <bitfield name="TCC3_" caption="TCC3" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL" mask="0x40000"/>
          <bitfield name="I2S_" caption="I2S" mask="0x80000"/>
          <bitfield name="OPAMP_" caption="OPAMP" mask="0x100000"/>
          <bitfield name="TRAM_" caption="TRAM" mask="0x200000"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x0000C000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1000"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x2000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="IDAU_" caption="IDAU APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x10"/>
          <bitfield name="USB_" caption="USB APB Protect Enable" mask="0x20"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x40"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x800"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TCC3_" caption="TCC3 APB Protect Enable" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC APB Protect Enable" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x40000"/>
          <bitfield name="I2S_" caption="I2S APB Protect Enable" mask="0x80000"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Protect Enable" mask="0x100000"/>
          <bitfield name="TRAM_" caption="TRAM APB Protect Enable" mask="0x200000"/>
        </register>
        <register name="NONSECA" offset="0x54" rw="R" size="4" initval="0x00000000" caption="Peripheral non-secure status - Bridge A">
          <bitfield name="PAC_" caption="PAC Non-Secure" mask="0x1"/>
          <bitfield name="PM_" caption="PM Non-Secure" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK Non-Secure" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC Non-Secure" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL Non-Secure" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL Non-Secure" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC Non-Secure" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK Non-Secure" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT Non-Secure" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC Non-Secure" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC Non-Secure" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM Non-Secure" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT Non-Secure" mask="0x1000"/>
          <bitfield name="AC_" caption="AC Non-Secure" mask="0x2000"/>
        </register>
